#1. Вывести текстом прямоугольник размером m на n состоящий, из единиц.
m, n = int(input()), int(input())
print(('1' * n + '\n') * m)